tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "beeftornado/rmtree"
tap "caskroom/fonts"
tap "domt4/autoupdate"

brew "bash-completion"
brew "coreutils"

brew "curl"
brew "wget", args: ["with-iri"]
brew "sqlite"
brew "mariadb"
brew "postgresql"
brew "pgcli"

brew "ack"
brew "jq"
brew "tree"
brew "ssh-copy-id"

brew "mas"
brew "freetype"
brew "findutils"
brew "fontconfig", args: ["universal"]
brew "jpeg"
brew "jpeg-turbo"
brew "libpng"
brew "libtiff"
brew "gd"
brew "zlib"
brew "imagemagick", args: ["with-webp"]

brew "watchman"
brew "terminal-notifier", link: false
brew "cocoapods"
brew "gradle"

brew "sdl2"
brew "x265"
brew "webp"
brew "libssh"
brew "chromaprint"
brew "fdk-aac"
brew "libass"
brew "tesseract"

brew "ffmpeg", args: ["with-tools","with-fdk-aac","with-freetype","with-libass","with-libvorbis","with-libvpx","with-x265","with-chromaprint","with-libssh","with-libopenssl","with-sdl2","with-webp"]

brew "subversion"
brew "mercurial"
brew "git"
brew "git-extras"
brew "git-fresh"
brew "git-crypt"
brew "git-flow"
brew "git-lfs"

brew "openssl"
brew "rsync"
brew "yarn", args: ["without-node"]
brew "argon2"

brew "youtube-dl"

brew "php72"
brew "composer"

brew "python"
brew "python3"
brew "pip-completion"
brew "ansible"

brew "ruby"

brew "haskell-stack"
brew "scala"
brew "sbt"

brew "htop"
brew "pv"
brew "osquaery"
brew "boost"
brew "c-ares"
brew "cabal-install"
brew "cabextract"
brew "capnp"
brew "carthage"
brew "cmake"
brew "dbus"
brew "docbook"
brew "doxygen"
brew "gflags"
brew "wine"
brew "winetricks"
brew "unixodbc"
brew "aspell"
brew "freetds"
brew "gmp"
brew "icu4c"
brew "wabt"
brew "utf8proc"
brew "uchardet"
brew "tree"
brew "texi2html"
brew "srtp"
brew "libsodium"
brew "lua@5.1"
brew "nasm"
brew "nghttp2"
brew "ninja"
brew "pkg-config"
brew "protobuf"
brew "qrencode"
brew "fpp"

################
# Core stuff
################
cask "java"
cask "postman"
cask "virtualbox"
cask "virtualbox-extension-pack"

cask "vagrant"
cask "xquartz"

cask "fastlane"
cask "genymotion"
cask "imageoptim"

cask "dropbox"
cask "fastscripts"

cask "iterm2"
cask "spectacle"
cask "sourcetree"
cask "typora"
cask "google-hangouts"

cask "gpgtools"
mas "Flycut", id: 442160987

cask "cakebrew"
cask "gitHub-desktop"
cask "keepassx"

# Developer
cask "ngrok"
cask "sequel-pro"
cask "tunnelblick"
cask "insomnia"
cask "syncthing-bar"

cask "prey"

# Quick Look plugins
cask "betterzipql"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlimagesize"
cask "quicklook-csv"
cask "quicklook-json"
cask "qlprettypatch"
cask "qlstephen"
cask "quicknfo"

cask "suspicious-package"
cask "webpquicklook"
cask "epubquicklook"
cask "font-hack"
cask "qlvideo"

# Color pickers
cask "colorpicker-developer"
cask "colorpicker-skalacolor"

# Installing Fonts
cask "font-dosis"
cask "font-droid-sans"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-condensed"
cask "font-roboto-slab"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-lato"
cask "font-menlo-for-powerline"
cask "font-meslo-lg"
cask "font-meslo-for-powerline"
cask "font-noto-sans"
cask "font-noto-serif"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-ubuntu"
cask "font-pt-mono"
cask "font-pt-sans"
cask "font-pt-serif"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-source-code-pro"
