tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/command-not-found"
tap "homebrew/php"
tap "homebrew/services"
tap "beeftornado/rmtree"
tap "homebrew/science"

brew "bash-completion"
brew "coreutils"

brew "curl"
brew "wget"
brew "mariadb"
brew "postgresql"

brew "ack"
brew "jq"
brew "tree"
brew "ssh-copy-id"

brew "mas"
brew "freetype"
brew "jpeg"
brew "libpng"
brew "gd"
brew "zlib"
brew "imagemagick"

brew "sdl2"
brew "x265"
brew "webp"
brew "libssh"
brew "chromaprint"
brew "fdk-aac"
brew "libass"
brew "tesseract"

brew "ffmpeg", args: ["with-tools","with-fdk-aac","with-freetype","with-libass","with-libvorbis","with-libvpx","with-x265","with-chromaprint","with-libssh","with-libopenssl","with-sdl2","with-webp"]

brew "subversion"
brew "mercurial"
brew "git"
brew "git-crypt"
brew "git-flow"
brew "git-lfs"

brew "openssl"
brew "rsync"
brew "yarn"

brew "youtube-dl"

brew "php71"
brew "composer"

brew "python"
brew "python3"
brew "pip-completion"
brew "ansible"

brew "ruby"

################
# Core stuff
################
cask "java"
cask "postman"
cask "virtualbox"
cask "virtualbox-extension-pack"

cask "vagrant"
cask "xquartz"

cask "dropbox"
cask "fastscripts"

# Quick Look plugins
cask "betterzipql"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-json"
cask "quicknfo"

cask "suspicious-package"
cask "webpquicklook"

# Color pickers
cask "colorpicker-developer"
cask "colorpicker-skalacolor"
